; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	satellite3 - satellite
	instrument10 - instrument
	instrument11 - instrument
	instrument12 - instrument
	thermograph2 - mode
	infrared3 - mode
	thermograph4 - mode
	image0 - mode
	thermograph1 - mode
	Star14 - direction
	Star20 - direction
	Star35 - direction
	Star38 - direction
	Star10 - direction
	GroundStation7 - direction
	Star36 - direction
	Star27 - direction
	Star9 - direction
	GroundStation25 - direction
	Star33 - direction
	GroundStation4 - direction
	GroundStation1 - direction
	Star5 - direction
	GroundStation11 - direction
	GroundStation39 - direction
	Star8 - direction
	Star13 - direction
	Star31 - direction
	Star26 - direction
	GroundStation6 - direction
	GroundStation34 - direction
	GroundStation16 - direction
	GroundStation17 - direction
	Star30 - direction
	Star2 - direction
	Star23 - direction
	GroundStation3 - direction
	GroundStation18 - direction
	Star22 - direction
	Star12 - direction
	Star15 - direction
	Star37 - direction
	Star21 - direction
	Star19 - direction
	GroundStation24 - direction
	GroundStation29 - direction
	Star0 - direction
	Star28 - direction
	GroundStation32 - direction
	Star40 - direction
	Phenomenon41 - direction
	Phenomenon42 - direction
	Star43 - direction
	Phenomenon44 - direction
	Phenomenon45 - direction
	Phenomenon46 - direction
	Phenomenon47 - direction
	Phenomenon48 - direction
	Star49 - direction
	Star50 - direction
	Planet51 - direction
	Phenomenon52 - direction
	Phenomenon53 - direction
	Planet54 - direction
	Phenomenon55 - direction
	Star56 - direction
	Planet57 - direction
	Planet58 - direction
	Star59 - direction
	Phenomenon60 - direction
	Phenomenon61 - direction
	Star62 - direction
	Planet63 - direction
	Star64 - direction
)
(:init
	(supports instrument0 image0)
	(supports instrument0 thermograph2)
	(calibration_target instrument0 Star5)
	(calibration_target instrument0 GroundStation24)
	(calibration_target instrument0 Star21)
	(calibration_target instrument0 Star15)
	(calibration_target instrument0 Star23)
	(calibration_target instrument0 Star37)
	(calibration_target instrument0 Star27)
	(calibration_target instrument0 GroundStation34)
	(calibration_target instrument0 GroundStation16)
	(calibration_target instrument0 Star38)
	(calibration_target instrument0 Star30)
	(supports instrument1 thermograph4)
	(calibration_target instrument1 Star19)
	(calibration_target instrument1 Star33)
	(calibration_target instrument1 GroundStation4)
	(calibration_target instrument1 Star10)
	(calibration_target instrument1 Star12)
	(calibration_target instrument1 GroundStation24)
	(calibration_target instrument1 GroundStation18)
	(calibration_target instrument1 Star37)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star37)
	(supports instrument2 thermograph2)
	(calibration_target instrument2 Star8)
	(calibration_target instrument2 Star15)
	(calibration_target instrument2 Star30)
	(calibration_target instrument2 GroundStation32)
	(calibration_target instrument2 GroundStation17)
	(supports instrument3 image0)
	(supports instrument3 infrared3)
	(calibration_target instrument3 Star26)
	(calibration_target instrument3 Star5)
	(calibration_target instrument3 GroundStation25)
	(calibration_target instrument3 Star12)
	(calibration_target instrument3 Star30)
	(calibration_target instrument3 Star9)
	(calibration_target instrument3 GroundStation6)
	(calibration_target instrument3 Star0)
	(calibration_target instrument3 Star2)
	(calibration_target instrument3 Star27)
	(calibration_target instrument3 Star36)
	(calibration_target instrument3 GroundStation7)
	(supports instrument4 thermograph2)
	(supports instrument4 thermograph4)
	(supports instrument4 thermograph1)
	(calibration_target instrument4 Star19)
	(supports instrument5 image0)
	(supports instrument5 thermograph1)
	(calibration_target instrument5 Star28)
	(calibration_target instrument5 Star33)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation18)
	(supports instrument6 thermograph2)
	(supports instrument6 infrared3)
	(supports instrument6 image0)
	(calibration_target instrument6 Star13)
	(calibration_target instrument6 GroundStation29)
	(calibration_target instrument6 Star28)
	(calibration_target instrument6 GroundStation11)
	(calibration_target instrument6 Star5)
	(calibration_target instrument6 GroundStation24)
	(calibration_target instrument6 GroundStation18)
	(calibration_target instrument6 GroundStation1)
	(calibration_target instrument6 GroundStation4)
	(calibration_target instrument6 GroundStation3)
	(supports instrument7 thermograph1)
	(supports instrument7 thermograph4)
	(supports instrument7 infrared3)
	(calibration_target instrument7 Star13)
	(calibration_target instrument7 Star23)
	(supports instrument8 thermograph2)
	(calibration_target instrument8 Star37)
	(calibration_target instrument8 Star8)
	(calibration_target instrument8 Star15)
	(calibration_target instrument8 GroundStation39)
	(supports instrument9 image0)
	(supports instrument9 infrared3)
	(supports instrument9 thermograph4)
	(calibration_target instrument9 GroundStation39)
	(calibration_target instrument9 GroundStation6)
	(calibration_target instrument9 Star0)
	(calibration_target instrument9 Star37)
	(calibration_target instrument9 Star22)
	(calibration_target instrument9 Star13)
	(calibration_target instrument9 GroundStation11)
	(calibration_target instrument9 GroundStation17)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(on_board instrument8 satellite2)
	(on_board instrument9 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation6)
	(supports instrument10 thermograph1)
	(supports instrument10 image0)
	(supports instrument10 thermograph4)
	(calibration_target instrument10 Star37)
	(calibration_target instrument10 Star26)
	(calibration_target instrument10 Star13)
	(calibration_target instrument10 Star8)
	(calibration_target instrument10 Star0)
	(supports instrument11 infrared3)
	(calibration_target instrument11 Star23)
	(calibration_target instrument11 Star2)
	(calibration_target instrument11 Star30)
	(calibration_target instrument11 GroundStation17)
	(calibration_target instrument11 GroundStation24)
	(calibration_target instrument11 Star37)
	(calibration_target instrument11 GroundStation16)
	(calibration_target instrument11 GroundStation34)
	(calibration_target instrument11 GroundStation6)
	(calibration_target instrument11 Star26)
	(calibration_target instrument11 Star31)
	(calibration_target instrument11 Star22)
	(supports instrument12 thermograph1)
	(supports instrument12 infrared3)
	(supports instrument12 thermograph4)
	(calibration_target instrument12 GroundStation32)
	(calibration_target instrument12 Star28)
	(calibration_target instrument12 Star0)
	(calibration_target instrument12 GroundStation29)
	(calibration_target instrument12 GroundStation24)
	(calibration_target instrument12 Star19)
	(calibration_target instrument12 Star21)
	(calibration_target instrument12 Star37)
	(calibration_target instrument12 Star15)
	(calibration_target instrument12 Star12)
	(calibration_target instrument12 Star22)
	(calibration_target instrument12 GroundStation18)
	(calibration_target instrument12 GroundStation3)
	(on_board instrument10 satellite3)
	(on_board instrument11 satellite3)
	(on_board instrument12 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation4)
)
(:goal (and
	(pointing satellite0 Phenomenon46)
	(pointing satellite1 Star28)
	(have_image Star40 thermograph2)
	(have_image Phenomenon41 thermograph1)
	(have_image Phenomenon42 thermograph4)
	(have_image Star43 image0)
	(have_image Phenomenon44 thermograph1)
	(have_image Phenomenon45 thermograph1)
	(have_image Phenomenon46 thermograph1)
	(have_image Phenomenon47 thermograph2)
	(have_image Phenomenon48 image0)
	(have_image Star49 thermograph1)
	(have_image Star50 image0)
	(have_image Planet51 infrared3)
	(have_image Phenomenon52 infrared3)
	(have_image Phenomenon53 image0)
	(have_image Planet54 thermograph2)
	(have_image Phenomenon55 thermograph2)
	(have_image Star56 image0)
	(have_image Planet57 thermograph4)
	(have_image Planet58 thermograph4)
	(have_image Star59 thermograph1)
	(have_image Phenomenon60 thermograph2)
	(have_image Phenomenon61 thermograph2)
	(have_image Star62 thermograph2)
	(have_image Planet63 thermograph1)
	(have_image Star64 image0)
))

)

; plan
1. (switch_on instrument10 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument10)
   goals met: 0 of 27
2. (switch_on instrument9 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument9)
   goals met: 0 of 27
3. (calibrate satellite2 instrument9 groundstation6)
   added: (calibrated instrument9)
   goals met: 0 of 27
4. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 27
5. (calibrate satellite0 instrument0 star37)
   added: (calibrated instrument0)
   goals met: 0 of 27
6. (turn_to satellite3 phenomenon41 groundstation4)
   deleted: (pointing satellite3 groundstation4)
   added: (pointing satellite3 phenomenon41)
   goals met: 0 of 27
7. (turn_to satellite2 phenomenon42 groundstation6)
   deleted: (pointing satellite2 groundstation6)
   added: (pointing satellite2 phenomenon42)
   goals met: 0 of 27
8. (take_image satellite2 phenomenon42 instrument9 thermograph4)
   added: (have_image phenomenon42 thermograph4)
   goals met: 1 of 27
9. (turn_to satellite2 phenomenon48 phenomenon42)
   deleted: (pointing satellite2 phenomenon42)
   added: (pointing satellite2 phenomenon48)
   goals met: 1 of 27
10. (take_image satellite2 phenomenon48 instrument9 image0)
   added: (have_image phenomenon48 image0)
   goals met: 2 of 27
11. (turn_to satellite2 phenomenon52 phenomenon48)
   deleted: (pointing satellite2 phenomenon48)
   added: (pointing satellite2 phenomenon52)
   goals met: 2 of 27
12. (take_image satellite2 phenomenon52 instrument9 infrared3)
   added: (have_image phenomenon52 infrared3)
   goals met: 3 of 27
13. (turn_to satellite2 phenomenon53 phenomenon52)
   deleted: (pointing satellite2 phenomenon52)
   added: (pointing satellite2 phenomenon53)
   goals met: 3 of 27
14. (take_image satellite2 phenomenon53 instrument9 image0)
   added: (have_image phenomenon53 image0)
   goals met: 4 of 27
15. (turn_to satellite2 planet51 phenomenon53)
   deleted: (pointing satellite2 phenomenon53)
   added: (pointing satellite2 planet51)
   goals met: 4 of 27
16. (take_image satellite2 planet51 instrument9 infrared3)
   added: (have_image planet51 infrared3)
   goals met: 5 of 27
17. (turn_to satellite2 planet57 planet51)
   deleted: (pointing satellite2 planet51)
   added: (pointing satellite2 planet57)
   goals met: 5 of 27
18. (take_image satellite2 planet57 instrument9 thermograph4)
   added: (have_image planet57 thermograph4)
   goals met: 6 of 27
19. (turn_to satellite2 planet58 planet57)
   deleted: (pointing satellite2 planet57)
   added: (pointing satellite2 planet58)
   goals met: 6 of 27
20. (take_image satellite2 planet58 instrument9 thermograph4)
   added: (have_image planet58 thermograph4)
   goals met: 7 of 27
21. (turn_to satellite2 star43 planet58)
   deleted: (pointing satellite2 planet58)
   added: (pointing satellite2 star43)
   goals met: 7 of 27
22. (take_image satellite2 star43 instrument9 image0)
   added: (have_image star43 image0)
   goals met: 8 of 27
23. (turn_to satellite2 star50 star43)
   deleted: (pointing satellite2 star43)
   added: (pointing satellite2 star50)
   goals met: 8 of 27
24. (take_image satellite2 star50 instrument9 image0)
   added: (have_image star50 image0)
   goals met: 9 of 27
25. (turn_to satellite2 star56 star50)
   deleted: (pointing satellite2 star50)
   added: (pointing satellite2 star56)
   goals met: 9 of 27
26. (take_image satellite2 star56 instrument9 image0)
   added: (have_image star56 image0)
   goals met: 10 of 27
27. (turn_to satellite2 star64 star56)
   deleted: (pointing satellite2 star56)
   added: (pointing satellite2 star64)
   goals met: 10 of 27
28. (take_image satellite2 star64 instrument9 image0)
   added: (have_image star64 image0)
   goals met: 11 of 27
29. (turn_to satellite1 star28 groundstation18)
   deleted: (pointing satellite1 groundstation18)
   added: (pointing satellite1 star28)
   goals met: 12 of 27
30. (turn_to satellite0 phenomenon46 star37)
   deleted: (pointing satellite0 star37)
   added: (pointing satellite0 phenomenon46)
   goals met: 13 of 27
31. (turn_to satellite3 star8 phenomenon41)
   deleted: (pointing satellite3 phenomenon41)
   added: (pointing satellite3 star8)
   goals met: 13 of 27
32. (calibrate satellite3 instrument10 star8)
   added: (calibrated instrument10)
   goals met: 13 of 27
33. (turn_to satellite3 phenomenon41 star8)
   deleted: (pointing satellite3 star8)
   added: (pointing satellite3 phenomenon41)
   goals met: 13 of 27
34. (take_image satellite3 phenomenon41 instrument10 thermograph1)
   added: (have_image phenomenon41 thermograph1)
   goals met: 14 of 27
35. (turn_to satellite3 phenomenon44 phenomenon41)
   deleted: (pointing satellite3 phenomenon41)
   added: (pointing satellite3 phenomenon44)
   goals met: 14 of 27
36. (take_image satellite3 phenomenon44 instrument10 thermograph1)
   added: (have_image phenomenon44 thermograph1)
   goals met: 15 of 27
37. (turn_to satellite3 phenomenon45 phenomenon44)
   deleted: (pointing satellite3 phenomenon44)
   added: (pointing satellite3 phenomenon45)
   goals met: 15 of 27
38. (take_image satellite3 phenomenon45 instrument10 thermograph1)
   added: (have_image phenomenon45 thermograph1)
   goals met: 16 of 27
39. (turn_to satellite3 phenomenon46 phenomenon45)
   deleted: (pointing satellite3 phenomenon45)
   added: (pointing satellite3 phenomenon46)
   goals met: 16 of 27
40. (take_image satellite3 phenomenon46 instrument10 thermograph1)
   added: (have_image phenomenon46 thermograph1)
   goals met: 17 of 27
41. (turn_to satellite3 planet63 phenomenon46)
   deleted: (pointing satellite3 phenomenon46)
   added: (pointing satellite3 planet63)
   goals met: 17 of 27
42. (take_image satellite3 planet63 instrument10 thermograph1)
   added: (have_image planet63 thermograph1)
   goals met: 18 of 27
43. (turn_to satellite3 star49 planet63)
   deleted: (pointing satellite3 planet63)
   added: (pointing satellite3 star49)
   goals met: 18 of 27
44. (take_image satellite3 star49 instrument10 thermograph1)
   added: (have_image star49 thermograph1)
   goals met: 19 of 27
45. (turn_to satellite3 star59 star49)
   deleted: (pointing satellite3 star49)
   added: (pointing satellite3 star59)
   goals met: 19 of 27
46. (take_image satellite3 star59 instrument10 thermograph1)
   added: (have_image star59 thermograph1)
   goals met: 20 of 27
47. (turn_to satellite0 phenomenon47 phenomenon46)
   deleted: (pointing satellite0 phenomenon46)
   added: (pointing satellite0 phenomenon47)
   goals met: 19 of 27
48. (take_image satellite0 phenomenon47 instrument0 thermograph2)
   added: (have_image phenomenon47 thermograph2)
   goals met: 20 of 27
49. (turn_to satellite0 phenomenon46 phenomenon47)
   deleted: (pointing satellite0 phenomenon47)
   added: (pointing satellite0 phenomenon46)
   goals met: 21 of 27
50. (turn_to satellite0 phenomenon55 phenomenon46)
   deleted: (pointing satellite0 phenomenon46)
   added: (pointing satellite0 phenomenon55)
   goals met: 20 of 27
51. (take_image satellite0 phenomenon55 instrument0 thermograph2)
   added: (have_image phenomenon55 thermograph2)
   goals met: 21 of 27
52. (turn_to satellite0 phenomenon46 phenomenon55)
   deleted: (pointing satellite0 phenomenon55)
   added: (pointing satellite0 phenomenon46)
   goals met: 22 of 27
53. (turn_to satellite0 phenomenon60 phenomenon46)
   deleted: (pointing satellite0 phenomenon46)
   added: (pointing satellite0 phenomenon60)
   goals met: 21 of 27
54. (take_image satellite0 phenomenon60 instrument0 thermograph2)
   added: (have_image phenomenon60 thermograph2)
   goals met: 22 of 27
55. (turn_to satellite0 phenomenon46 phenomenon60)
   deleted: (pointing satellite0 phenomenon60)
   added: (pointing satellite0 phenomenon46)
   goals met: 23 of 27
56. (turn_to satellite0 phenomenon61 phenomenon46)
   deleted: (pointing satellite0 phenomenon46)
   added: (pointing satellite0 phenomenon61)
   goals met: 22 of 27
57. (take_image satellite0 phenomenon61 instrument0 thermograph2)
   added: (have_image phenomenon61 thermograph2)
   goals met: 23 of 27
58. (turn_to satellite0 phenomenon46 phenomenon61)
   deleted: (pointing satellite0 phenomenon61)
   added: (pointing satellite0 phenomenon46)
   goals met: 24 of 27
59. (turn_to satellite0 planet54 phenomenon46)
   deleted: (pointing satellite0 phenomenon46)
   added: (pointing satellite0 planet54)
   goals met: 23 of 27
60. (take_image satellite0 planet54 instrument0 thermograph2)
   added: (have_image planet54 thermograph2)
   goals met: 24 of 27
61. (turn_to satellite0 phenomenon46 planet54)
   deleted: (pointing satellite0 planet54)
   added: (pointing satellite0 phenomenon46)
   goals met: 25 of 27
62. (turn_to satellite0 star40 phenomenon46)
   deleted: (pointing satellite0 phenomenon46)
   added: (pointing satellite0 star40)
   goals met: 24 of 27
63. (take_image satellite0 star40 instrument0 thermograph2)
   added: (have_image star40 thermograph2)
   goals met: 25 of 27
64. (turn_to satellite0 phenomenon46 star40)
   deleted: (pointing satellite0 star40)
   added: (pointing satellite0 phenomenon46)
   goals met: 26 of 27
65. (turn_to satellite0 star62 phenomenon46)
   deleted: (pointing satellite0 phenomenon46)
   added: (pointing satellite0 star62)
   goals met: 25 of 27
66. (take_image satellite0 star62 instrument0 thermograph2)
   added: (have_image star62 thermograph2)
   goals met: 26 of 27
67. (turn_to satellite0 phenomenon46 star62)
   deleted: (pointing satellite0 star62)
   added: (pointing satellite0 phenomenon46)
   goals met: 27 of 27
